Revit 2024 API
GBXMLExportOptions Class
 Green-Building XML Export options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class GBXMLExportOptions : IDisposable
Visual Basic
Public Class GBXMLExportOptions _
	Implements IDisposable
Visual C++
public ref class GBXMLExportOptions : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.GBXMLExportOptions
See Also
GBXMLExportOptions Members
Autodesk.Revit.DB Namespace